#+title: CKY Parsing With Independence Constraints
#+author:
#+OPTIONS: H:3 toc:nil _:{}
#+LATEX_CLASS: acl2015
#+LATEX_HEADER: \usepackage{forest}
#+LATEX_HEADER: \DeclareMathOperator*{\argmin}{arg\,min}
#+LATEX_HEADER: \DeclareMathOperator*{\argmax}{arg\,max}
#+LaTeX_HEADER: \newcommand{\BigO}[1]{\ensuremath{\operatorname{O}\bigl(#1\bigr)}}

# file:paper.pdf

#+BEGIN_LaTeX
\begin{abstract}
The CKY algorithm is an important component in many natural language
parsers. We propose a novel type of constraint for context-free
parsing called independence constraints. Based on the concept
of independence between words, we show how these constraints can be
used to reduce the work done in the CKY algorithm. We demonstrate a
classifier which can be used to identify boundaries between
independent words in a sentence using only surface features, and show
that it can be used to speed up a CKY parser. We investigate the
tradeoff between speed and accuracy, and indicate directions for
improvement.
\end{abstract}
#+END_LaTeX

** Results

#+BEGIN_LaTeX
\begin{table*}[tbp]
%\resizebox{12cm}{!}{
#+END_LaTeX

#+attr_latex: :center nil
| SentLen | Constraints   | Time (s) | # Edges                | F_1           | Parse Failures |
|---------+---------------+----------+------------------------+---------------+----------------|
|       0 | default       |     1283 | 1.08\times10^10 (62%)  | 83.71 (-2.14) |             15 |
|       0 | precision     |     1143 | 1.13\times10^10 (65%)  | 84.05 (-1.80) |              7 |
|       0 | max precision |     1384 | 1.42\times10^10 (81%)  | 85.55 (-0.30) |              2 |
|       0 | recall        |     1024 | 7.80\times10^09 (45%)  | 78.74 (-7.11) |            136 |
|      20 | default       |     1126 | 1.12\times10^10 (64%)  | 84.17 (-1.68) |              9 |
|      20 | precision     |     1313 | 1.16\times10^10 (66%)  | 84.43 (-1.42) |              4 |
|      20 | max precision |     1338 | 1.44\times10^10 (82%)  | 85.59 (-0.26) |              2 |
|      20 | recall        |     1121 | 8.24\times10^09 (47%)  | 80.38 (-5.47) |            103 |
|      30 | default       |     1312 | 1.28\times10^10 (73%)  | 84.82 (-1.03) |              3 |
|      30 | precision     |     1279 | 1.31\times10^10 (75%)  | 85.01 (-0.84) |              1 |
|      30 | max precision |     1485 | 1.53\times10^10 (87%)  | 85.63 (-0.22) |              1 |
|      30 | recall        |     1140 | 1.02\times10^10 (58%)  | 82.79 (-3.06) |             57 |
|      40 | default       |     1476 | 1.51\times10^10 (86%)  | 85.56 (-0.29) |              1 |
|      40 | precision     |     1390 | 1.52\times10^10 (87%)  | 85.59 (-0.26) |              0 |
|      40 | max precision |     1513 | 1.65\times10^10 (94%)  | 85.75 (-0.10) |              0 |
|      40 | recall        |     1403 | 1.33\times10^10 (76%)  | 84.65 (-1.20) |             14 |
|---------+---------------+----------+------------------------+---------------+----------------|
|       ∞ | baseline      |     1558 | 1.75\times10^10 (100%) | 85.85         |              0 |
#+TBLFM: $3=$0;%.2e::$6=$5-85.85;p4%.2f

#+BEGIN_LaTeX
%}
\caption{Independence constraints reduce the work done by the CKY algorithm, trading off accuracy.}
\label{tbl:parse-results-linear}
\end{table*}
#+END_LaTeX

The results of running the parser on section 22 using the linear
classifier from Section \ref{sec:linear-classifier} are shown in
Table \ref{tbl:parse-results-linear}. The table shows the total time
taken, the total times entering the inner loop, the F_1 and difference
from the baseline, and the number of times the parse failed using the
constraints. The baseline consisted of the same parser with the
sentence length threshold set to 1000. The time includes the time
spent reading in the constraints but not the time taken by the
classifier.

The parser with the independence constraints saves 35-38%
of the computation inside the CKY loop over the baseline,
corresponding to about 20% reduction in total time, at the cost of a
2-point drop in F-score. After increasing recall by making negative
instances for which the classifier assigned a low probability positive,
the parser reduced the work done inside the loop to less than half the
baseline, but accuracy also plummeted by 7 points.

** Polynomial Kernel

A difference of 2 F_1 score is not small, but on the other hand it is
about by how much the unlexicalized Stanford Parser trails the Collins
parser, for example. However, as shown above in Section
\ref{sec:poly-classifier}, there is room to improve the linear
classifier through conjunctive features. As an indication of an upper
bound of the acheivable performance, we tried using the output of the
kernel classifier in the parser as above, while acknowledging that at
present the time needed to produce the classifier output dwarfs the
time needed to actually parse the test data.

The results of running the parser on section 22 with the polynomial
classifier output are shown in Table \ref{tbl:parse-results-poly}.
With the more accurate classifier, the parser is able to reduce the
necessary computation even further, by about 45%, while losing less
accuracy. With a high-precision threshold, the computation of the CKY
algorithm is reduced to less than 60% of the baseline, while losing
less than half a point F_1 score.

#+BEGIN_LaTeX
\begin{table*}[tbp]
%\resizebox{12cm}{!}{
#+END_LaTeX

#+attr_latex: :center nil
| SentLen | Constraints   | Time (s) | # Edges                | F_1           | Parse Failures |
|---------+---------------+----------+------------------------+---------------+----------------|
|       0 | default       |     1106 | 9.74\times10^09 (56%)  | 84.85 (-1.00) |              6 |
|       0 | precision     |     1118 | 9.84\times10^09 (56%)  | 85.12 (-0.73) |              4 |
|       0 | max precision |     1137 | 1.02\times10^10 (58%)  | 85.42 (-0.43) |              2 |
|       0 | recall        |     1050 | 9.25\times10^09 (53%)  | 84.05 (-1.80) |             33 |
|      20 | default       |     1070 | 1.02\times10^10 (58%)  | 85.08 (-0.77) |              5 |
|      20 | precision     |     1172 | 1.03\times10^10 (59%)  | 85.25 (-0.60) |              3 |
|      20 | max precision |     1092 | 1.06\times10^10 (61%)  | 85.41 (-0.44) |              2 |
|      20 | recall        |     1088 | 9.68\times10^09 (55%)  | 84.75 (-1.10) |              7 |
|      30 | default       |     1222 | 1.20\times10^10 (69%)  | 85.57 (-0.28) |              1 |
|      30 | precision     |     1267 | 1.20\times10^10 (69%)  | 85.62 (-0.23) |              1 |
|      30 | max precision |     1238 | 1.23\times10^10 (70%)  | 85.65 (-0.20) |              1 |
|      30 | recall        |     1238 | 1.16\times10^10 (66%)  | 85.44 (-0.41) |              2 |
|      40 | default       |     1465 | 1.49\times10^10 (85%)  | 85.72 (-0.13) |              0 |
|      40 | precision     |     1353 | 1.49\times10^10 (85%)  | 85.75 (-0.10) |              0 |
|      40 | max precision |     1570 | 1.50\times10^10 (86%)  | 85.78 (-0.07) |              0 |
|      40 | recall        |     1489 | 1.47\times10^10 (84%)  | 85.69 (-0.16) |              1 |
|---------+---------------+----------+------------------------+---------------+----------------|
|       ∞ | baseline      |     1470 | 1.75\times10^10 (100%) | 85.85         |              0 |
#+TBLFM: $3=$0;%.2e::$6=$5-85.85;p4%.2f

#+BEGIN_LaTeX
%}
\caption{The classifier using the polynomial kernel is much more accurate, leading to smaller loss in accuracy of the parser.}
\label{tbl:parse-results-poly}
\end{table*}
#+END_LaTeX


# ** Gold Independent Span Boundaries

# For another comparison, we tested the parser using the gold
# independent span boundaries. The results for section 22 are shown in
# Table \ref{tbl:parse-results-oracle}. The number of binary edges
# visited is cut in half, and parse accuracy is improved by almost 1
# point. We note that the parser was unable to parse 4 sentences with
# the gold constraints.

# #+BEGIN_LaTeX
# \begin{table}[tbp]
# %\resizebox{12cm}{!}{
# #+END_LaTeX

# #+attr_latex: :center nil
# |         |          |                        |               |    Parse |
# | SentLen | Time (s) | # Edges                | F_1           | Failures |
# |---------+----------+------------------------+---------------+----------|
# |       0 |     1016 | 8.47\times10^09 (48%)  | 86.71 (+0.86) |        4 |
# |      20 |     1054 | 8.90\times10^09 (51%)  | 86.55 (+0.70) |        2 |
# |      30 |     1152 | 1.08\times10^10 (62%)  | 86.33 (+0.48) |        0 |
# |      40 |     1344 | 1.39\times10^10 (79%)  | 86.04 (+0.19) |        0 |
# |       ∞ |     1292 | 1.75\times10^10 (100%) | 85.85         |        0 |

# #+BEGIN_LaTeX
# %}
# \caption{Using the gold independent span boundaries halves the work done by the CKY algorithm while improving parse accuracy.}
# \label{tbl:parse-results-oracle}
# \end{table}
# #+END_LaTeX

